app/controllers/histories_controller.rb

  def create
    @history = @user.histories.create(params[:history])
---
INSERT INTO `histories` (`company`, `position`, `sector_id`, `created_at`, `updated_at`, `end`, `start`, `user_id`, `equipment`, `description`) VALUES('f', 'f', 1, '2010-08-23 05:50:36', '2010-08-23 05:50:36', '2010-08-01', '1996-08-01', 5, 'f', 'f')