app/controllers/industries_controller.rb

  def index
    @industries = Industry.all
---
SELECT * FROM `industries`

  def show
    @industry = Industry.find(params[:id])
---
SELECT * FROM `industries` WHERE (`industries`.`id` = 1)

  def create
    @industry = Industry.new(params[:industry])
      if @industry.save
---
INSERT INTO `industries` (`name`, `created_at`, `updated_at`) VALUES('Oil & Gas', '2010-08-23 03:41:57', '2010-08-23 03:41:57')