app/controllers/levels_controller.rb

  def index
    @levels = Level.all
---
SELECT * FROM `levels`

  def create
    @level = Level.new(params[:level])
      if @level.save
---
INSERT INTO `levels` (`created_at`, `updated_at`, `level`) VALUES('2010-08-23 03:41:40', '2010-08-23 03:41:40', 'RI Endorsement A/B/C/D')