app/controllers/password_resets_controller.rb

SELECT * FROM `users` WHERE (`users`.`email` = '') LIMIT 1
---
    def create
      @user = User.find_by_email(params[:email])