app/controllers/qualifications_controller.rb

  def create
    @qualification = @user.qualifications.create(params[:qualification])
---
INSERT INTO `qualifications` (`level_id`, `created_at`, `updated_at`, `body_id`, `cert_file_size`, `expire_date`, `cert_update_at`, `category_id`, `user_id`, `cert_content_type`, `technique_id`, `cert_file_name`) VALUES(2, '2010-08-23 05:46:39', '2010-08-23 05:46:39', 3, NULL, '2010-08-23', NULL, 1, 5, NULL, 1, NULL)