app/controllers/searches_controller.rb

  def index
    if params[:body] && params[:technique]
      @body = params[:body].to_i if params[:body].present?
      @technique = params[:technique].to_i if params[:technique].present?
---
SELECT * FROM `bodies`
SELECT * FROM `techniques`