app/controllers/searches_controller.rb

SELECT `bodies`.id FROM `bodies` WHERE (`bodies`.`id` = 0) LIMIT 1
SELECT `techniques`.id FROM `techniques` WHERE (`techniques`.`id` = 0) LIMIT 1
SELECT `qualifications`.id FROM `qualifications` WHERE (`qualifications`.user_id = 5) LIMIT 1
---
  def index
    body = Body.exists?(params[:body].to_i) ? Body.find(params[:body].to_i) : nil
    technique = Technique.exists?(params[:technique].to_i) ? Technique.find(params[:technique].to_i) : nil
    @users = Qualification.search(body, technique)