app/controllers/sectors_controller.rb

SELECT * FROM `sectors` ORDER BY name ASC
---
  def index
    @sectors = Sector.all