app/controllers/techniques_controller.rb

  def index
    @techniques = Technique.all
---
SELECT * FROM `techniques` ORDER BY name ASC