app/controllers/users_controller.rb

  def create
    @user = User.create(params[:user])
    if @user.save
---
INSERT INTO `users` (`name`, `address`, `passport_number`, `headshot_file_name`, `created_at`, `dob`, `crypted_password`, `updated_at`, `perishable_token`, `pcn_number`, `failed_login_count`, `home_phone`, `password_salt`, `headshot_updated_at`, `persistence_token`, `login_count`, `passport_expires`, `last_login_at`, `contact_email`, `headshot_content_type`, `headshot_file_size`, `other_body_id`, `email`, `nationality`, `mobile_phone`, `industry_id`) VALUES(NULL, NULL, NULL, NULL, '2010-09-03 06:52:01', NULL, '5694d3456c1dd40dc5932f331a84b16fd0c96049bed40e103fbb8061d48cc12a12cf36be559022c27bb9c88d8edb4040a9a2acbfc8af88dd7a8ea0e6656900b9', '2010-09-03 06:52:01', 'Gutgeryn5VbbhUIBkjWC', NULL, 0, NULL, '9fkDv4BZzSDpmhiCkhsV', NULL, 'bd8a61e41ebbc49032920c3ae665e8e9e5dcd7440fe56cb3655c000a9f9866790af0ed595e6c8287d33045b8ccaec2cc8cb647edd6d581ca0f49159c6ab1573d', 1, NULL, NULL, NULL, NULL, NULL, NULL, 'hando56@hotmail.com', NULL, NULL, NULL)
UPDATE `users` SET `updated_at` = '2010-07-29 07:23:16', `perishable_token` = 'ekN3IOhr7FVOic4rR0lF' WHERE `id` = 4

  def update
    if @user.update_attributes(params[:user])
---
UPDATE `users` SET `home_phone` = '', `updated_at` = '2010-08-23 04:26:50', `address` = '', `name` = 'jakle', `perishable_token` = 'JVef4fO-dytWnPocvpQE', `dob` = '1945-08-23', `contact_email` = '', `other_body_id` = '', `mobile_phone` = '', `nationality` = '', `industry_id` = 2, `passport_expires` = '2010-08-23', `pcn_number` = '', `passport_number` = '' WHERE `id` = 5